"""
Python Fundamentals 2025: Домашнее задание 9
Таблица умножения
Напишите программу, которая выводит таблицу умножения для чисел от 1 до n. 
Где n это число, которое введет пользователь. Оформите вывод так, чтобы столбцы были ровные (число ровно под числом)
Пример вывода:
Введите число: 5
"""


"""
b = int(input())
numer = b + 1
for i in range(1, numer):
    for j in range(1, numer):
        print(i*j, end="\t")
    print()
"""


"""
Лестница чисел
Напишите программу, которая принимает число n и выводит "лестницу" из чисел.
Каждая строка лестницы содержит числа от 1 до номера строки.
Пример вывода:
Введите число: 5 
"""



"""
n = int(input())

for i in range(1, n + 1):
    for j in range(1, i + 1):
        print(j, end=" ")
    print()
"""



"""
Удаление всех повторяющихся символов
Напишите программу, которая принимает строку и удаляет из неё все повторяющиеся символы,
сохраняя только первые их вхождения.
Пример вывода:
Введите строку: Python programming  
Результат: Python prgami
"""



"""
a = input()
caunt = ""
for i in a:
    if i in caunt:
        continue
    caunt += i
print(caunt)
"""