"""
1
Напишите программу, которая принимает от пользователя один символ
и выводит его код в таблице Unicode и его принадлежность к диапазону ASCII (True/False).
Пример вывода:
Введите символ: A  
Код Unicode: 65  
ASCII символ: True
"""
"""
a = input("Введите символ: ")
b = ord(a)
print("Код Unicode:", b)
if b > 127:
    print("ASCII символ: False")
else:
    print("ASCII символ: True")
"""






"""
2
Подстрока с заполнением
Напишите программу, которая принимает строку и индексы начала и конца. 
Программа должна вывести подстроку на указанных позициях.
Также если конечный индекс выходит за пределы строки, программа заполняет недостающие символы символами _.
Пример вывода:
едите строку: Программирование  
Введите начальный индекс: 3  
Введите конечный индекс: 20  
Подстрока: граммирование____
"""
"""
a = input("Введите строку: ")
n1 = int(input("Введите начальный индекс: "))
n2 = int(input("Введите конечный индекс: "))
b = a[n1:n2]
if n2 > len(a):
    diff = n2 - len(a)
    b += "_" * diff
print("Подстрока:", b)

"""







"""
3
Подсчёт символа
Напишите программу, которая принимает строку и символ, а затем подсчитывает, сколько раз символ встречается в строке.
Пример вывода:
Введите строку: Hello, world!  
Введите символ: o  
Символ o встречается 2 раз(а).
"""
"""
text = input()
char = input()
count = text.count(char)
print("символ", char, "Встреч", count)
"""







"""
4
Инвертирование строки без цифр
Напишите программу, которая принимает строку и выводит её в обратном порядке, пропуская все цифры.
Пример вывода:
Введите строку: n52uFs6Inoh67ty8P
Результат: PythonIsFun
"""

"""
a = input("Введите строку: ")
b = ""
i = len(a) - 1
while i >= 0:
    if not a[i].isdigit():
        b += a[i]
    i -= 1
print("Результат:", b)
"""

