"""
1
Сумма цифр числа
Напишите программу, которая вычисляет сумму цифр введённого числа.
Пример вывода:
Введите число: 12345
Сумма цифр: 15

"""
"""
a = int(input("Введите число: "))
z = str(a)
b = len(str(a))
sum_1 = 0
while b > 0:
    s = z[-1]
    sum_1 += int(s)
    z = z[:-1]
    b -= 1
print("Сумма цифр:", sum_1)
"""

"""
2
Палиндром
Напишите программу, которая запрашивает у пользователя целое число и определяет, 
является ли оно палиндромом. Число является палиндромом, если оно читается одинаково слева направо и справа налево.
Пример вывода:
Введите число: 12321
Число 12321 является палиндромом.
Введите число: 1234
Число 1234 не является палиндромом.
"""

"""
a = int(input("Введите число: "))
b = str(a)
n = b[::-1]
c = int(n)
if a == c:
    print("Число", a, "является палиндромом.")
else:
    print("Число", a, "не является палиндромом.")
"""

"""
3
Проверь интуицию
Напишите программу, которая генерирует случайное число от 1 до 100 включительно и дает пользователю 10 попыток,
чтобы угадать это число. Программа должна подсказывать,
больше или меньше загаданное число. После завершения игры программа оценивает, насколько хорошая интуиция у игрока.
Пример вывода:
Угадайте число от 1 до 100. У вас 10 попыток.
Ваше предположение: 50
Загаданное число меньше вашего
Ваше предположение: 25
Загаданное число больше вашего
Ваше предположение: 30
Поздравляем! Вы угадали число: 30.
Вы угадали число за 3 попытки. Отличный результат!
"""


"""
import random
print("Угадайте число от 1 до 100. У вас 10 попыток.")
caunt = 0
number = random.randint(1, 100)
while caunt != 10:
    a = int(input("Ваше предположение: "))
    caunt += 1
    if a == number:
        print("Поздравляем! Вы угадали число: ", number)
        break
    elif a > number:
        print("Загаданное число меньше вашего")
    else:
        print("Загаданное число больше вашего")
print("Вы угадали число за", caunt, "попытки. Отличный результат!")

"""