"""
Прогрессия увеличения
Напишите программу, которая создаёт новый кортеж, состоящий из элементов изначального в том же порядке.
Добавить в него только элементы, которые больше всех предыдущих значений в исходном кортеже.
Данные:
numbers = (3, 7, 2, 8, 5, 10, 1)
Пример вывода:
Кортеж по возрастанию: (3, 7, 8, 10)
"""

"""
numbers = (3, 7, 2, 8, 5, 10, 1)
result = [0]
b = numbers[0]
result.append(b)
for i in numbers[1:]:
    if i > b:
        result.append(i)
        b = i
b = tuple(result)
print(f"Кортеж по возрастанию:{b}")
"""




"""
Повторяющиеся элементы
Напишите программу, которая находит индексы элементов кортежа, встречающихся более одного раза. Вывести сами элементы и их индексы.
Данные:
numbers = (1, 2, 3, 4, 2, 5, 3, 6, 4, 2, 9)
Пример вывода:
Индексы элемента 2: 1 4 9
Индексы элемента 3: 2 6
Индексы элемента 4: 3 8
"""

numbers = (1, 2, 3, 4, 2, 5, 3, 6, 4, 2, 9)
element = {}
for index, n in enumerate(numbers):
    if n not in element:
        element[n] = []
    element[n].append(index)
for n, indexes in element.items():
    if len(indexes) > 1:
        print("Индексы элемента", n, ":", end=" ")
        for x in indexes:
            print(x, end=" ")
        print()
